Tekla Open API Reference for Tekla Structures 2025
CommitAction Properties
The CommitAction type exposes the following members.
Properties
Name | Description
Localization
 The localization instance for the dialog. Each dialog has its own localization instance that has read the localization files needed for that dialog.
 (Inherited from FormBase.)
Top
See Also
Reference
CommitAction Class
Tekla.Structures.Dialog.UIControls Namespace